## 806545929748: CloudTrail
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudtrail.satellite_trail will be created
  + resource "aws_cloudtrail" "satellite_trail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "CbsSatelliteTrail"
      + s3_bucket_name                = "cbs-satellite-806545929748"
      + s3_key_prefix                 = "cloudtrail_logs"
      + tags                          = {
          + "CostCentre" = "cbs-806545929748"
          + "Terraform"  = "true"
        }
      + tags_all                      = {
          + "CostCentre" = "cbs-806545929748"
          + "Terraform"  = "true"
        }
    }

  # aws_s3_bucket_policy.satellite_trail will be created
  + resource "aws_s3_bucket_policy" "satellite_trail" {
      + bucket = "cbs-satellite-806545929748"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::cbs-satellite-806545929748"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + aws:SourceArn = "arn:aws:cloudtrail:ca-central-1:806545929748:trail/CbsSatelliteTrail"
                              + s3:x-amz-acl  = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::cbs-satellite-806545929748/cloudtrail_logs/AWSLogs/806545929748/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
